package com.ssm.entity.common;

/**
 * 返回值枚举类
 * @author HY
 */
public enum ResultEnum {

    //--------------------正确返回值的编码对照表----------------------------
    /**
     * 调用成功
     */
    SUCCESS                 (200, "操作成功"),
    /**
     * 查询操作成功，没有获取符合查询条件的结果
     */
    QUERRY_SUCCESS_NO_RECORD(1, "查询操作成功[没有获取符合查询条件的结果]"),
    /**
     * 更新操作成功，没有更新任何数据
     */
    UPDATE_SUCCESS_NO_RECORD(2, "更新操作成功[没有更新任何数据]"),
    /**
     * 删除操作成功，没有删除任何数据
     */
    DELETE_SUCCESS_NO_RECORD(3, "删除操作成功[没有删除任何数据]"),
    /**
     * 增加操作成功，没有删除任何数据
     */
    INSERT_SUCESS_NO_RECORD (4, "增加操作成功[没有删除任何数据]"),
    /**
     * 没有记录可操作
     */
    OPERATE_NO_RECORD       (5, "没有记录可操作"),
    /**
     * 数据已存在
     */
    RECORD_EXISTS           (6, "数据已存在"),
    /**
     * 不需进行报文检查
     */
    NEEDLESS_MSG_CHECK      (101, "不需进行报文检查"),
    /**
     * 不需验签
     */
    NEEDLESS_VERIFY_SIGN    (102, "不需验签"),
    /**
     * 不需权限检查
     */
    NEEDLESS_AUTHCHECK      (103, "不需权限检查"),
    /**
     * 不需进行内部实体检查
     */
    NEEDLESS_ENTITY_CHECK   (104, "不需进行内部实体检查"),

    //--------------------共性错误的编码对照表----------------------------
    /**
     * 应用错误,泛化异常[在不用或不便确认何种异常时，使用该定义处理]
     */
    COMMON_EXCEPTION_ERROR(-900000, "操作失败[请联系相关人员解决]"), //在不用或不便确认何种异常时，使用该定义处理

    //---------------------数据库错误-----------------------------------
    /**
     * 数据库错误,Oracle数据库错误
     */
    ORACLE_DATABASE_ERROR   (-900101, "数据库错误[Oracle数据库错误]"),
    /**
     * 数据库错误,SQL Server错误
     */
    SQLSERVER_DATABASE_ERROR(-900102, "数据库错误[SQL Server错误]"),

    //---------------------参数错误-------------------------------------
    /**
     * 参数错误,空指针
     */
    NULL_POINTER_ERROR                (-900201, "参数错误[空指针]"),
    /**
     * 参数错误,数值格式不正确
     */
    DATA_FORMAT_ERROR                 (-900202, "参数错误[数值格式不正确]"),
    /**
     * 参数错误,数值过小
     */
    DATA_LESS_THAN_EXPECTATION_ERROR  (-900203, "参数错误[数值过小]"),
    /**
     * 参数错误,数值过大
     */
    DATA_MORE_THAN_EXPECTATION_ERROR  (-900204, "参数错误[数值过大]"),
    /**
     * 参数错误,字符串长度不正确
     */
    STRING_LENGTH_ERROR               (-900205, "参数错误[字符串长度不正确]"),
    /**
     * 参数错误,字符串为空
     */
    STRING_NULL_ERROR                 (-900206, "参数错误[字符串为空]"),
    /**
     * 参数错误,字符串过长
     */
    STRING_MORE_THAN_EXPECTATION_ERROR(-900207, "参数错误[字符串过长]"),
    /**
     * 参数错误,字符串过短
     */
    STRING_LESS_THAN_EXPECTATION_ERROR(-900208, "参数错误[字符串过短]"),

    //----------------------IO错误---------------------------------------
    /**
     * IO错误,路径/文件不存在
     */
    FILE_NOT_EXIT_ERROR(-900301, "IO错误[路径/文件不存在]"),
    /**
     * IO错误,打开文件失败
     */
    FILE_OPEN_ERROR    (-900302, "IO错误[打开文件失败]"),
    /**
     * IO错误,保存文件失败
     */
    FILE_SAVE_ERROR    (-900303, "IO错误[保存文件失败]"),
    /**
     * IO错误,读文件失败
     */
    FILE_READ_ERROR    (-900304, "IO错误[读文件失败]"),
    /**
     * IO错误,写文件失败
     */
    FILE_WRITE_ERROR   (-900305, "IO错误[写文件失败]"),
    /**
     * IO错误,锁文件失败
     */
    FILE_LOCK_ERROR    (-900306, "IO错误[锁文件失败]"),
    /**
     * IO错误,连接打印机失败
     */
    PRINTER_LINK_ERROR (-900307, "IO错误[连接打印机失败]"),
    /**
     * IO错误,打印失败
     */
    PRINT_ERROR        (-900308, "IO错误[打印失败]"),

    //---------------------配置文件错误-----------------------------------
    /**
     * 配置文件错误,无法获取配置项的值
     */
    CONFIG_ELEMENT_VALUE_GET_ERROR    (-900401, "配置文件错误[无法获取配置项的值]"),
    /**
     * 配置文件错误,无法设置配置项的值
     */
    CONFIG_ELEMENT_VALUE_SET_ERROR    (-900402, "配置文件错误[无法设置配置项的值]"),
    /**
     * 配置文件错误,配置项的值为无效值
     */
    CONFIG_ELEMENT_VALUE_INVALID_ERROR(-900403, "配置文件错误[配置项的值为无效值]"),

    //---------------------应用错误---------------------------------------
    /**
     * 应用错误,创建对象失败
     */
    CREATE_INSTANCE_ERROR	(-900501, "应用错误[创建对象失败]"),
    /**
     * 应用错误,数组/指针的下标越界
     */
    OUT_OF_RANGE_ERROR		(-900502, "应用错误[数组/指针的下标越界]"),
    /**
     * 应用错误,加签失败
     */
    SIGN_ERROR				(-900503, "应用错误[加签失败]"),
    /**
     * 应用错误,验签失败
     */
    VIRIFY_SIGN_ERROR		(-900504, "应用错误[验签失败]"),
    /**
     * 应用错误,加密失败
     */
    ENCRYPT_ERROR			(-900505, "应用错误[加密失败]"),
    /**
     * 应用错误,解密失败
     */
    DECRYPT_ERROR			(-900506, "应用错误[解密失败]"),
    /**
     * 应用错误,获取公钥失败
     */
    FETCH_PUBLIC_KEY_ERROR	(-900507, "应用错误[获取公钥失败]"),
    /**
     * 应用错误,压缩失败
     */
    COMPRESS_ERROR			(-900508, "应用错误[压缩失败]"),
    /**
     * 应用错误,解压缩失败
     */
    DECOMPRESS_ERROR        (-900509, "应用错误[解压缩失败]"),
    /**
     * 应用错误,XML转换成对象失败
     */
    OBJECT_TO_XML_ERROR     (-900510,"应用错误[对象转换成XML失败]"),
    /**
     * 应用错误,XML转换成对象失败
     */
    XML_TO_OBJECT_ERROR     (-900511, "应用错误[XML转换成对象失败]"),
    /**
     * 应用错误,请求数据类型错误
     */
    REQUEST_DATA_TYPE_ERROR (-900512, "应用错误[请求数据类型错误]"),
    /**
     * 应用错误,响应数据类型错误
     */
    RESPONSE_DATA_TYPE_ERROR(-900513, "应用错误[响应数据类型错误]"),
    /**
     * 应用错误,报文实体转换为内部实体错误
     */
    MSG_TO_ENTITY_ERROR		(-900514, "应用错误[报文实体转换为内部实体错误]"),
    /**
     * 应用错误,内部实体转换为报文实体错误
     */
    ENTITY_TO_MSG_ERROR		(-900515, "应用错误[内部实体转换为报文实体错误]"),
    /**
     * 应用错误,实体拼装错误
     */
    ENTITY_BUILD_ERROR		(-900516, "应用错误[实体拼装错误]"),

    /**
     * 应用错误,实体检查错误
     */
    ENTITY_CHECK_ERROR      (-900517, "应用错误[实体检查错误]"),
    /**
     * 应用错误,对象复制错误
     */
    OBJECT_COPY_ERROR       (-900518, "应用错误[对象复制错误]"),

    /**
     * 应用错误,权限校验失败
     */
    AUTH_CHECK_ERROR        (-900519, "应用错误[权限校验失败]"),

    /**
     * 应用错误,报文检查失败
     */
    MESSAGE_CHECK_ERROR     (-900520, "应用错误[报文检查失败]"),



    //----------------------系统错误----------------------------------------
    /**
     * 系统错误,环境变量设置不正确
     */
    ENVIRONMENT_VARIABLE_ERROR	(-900601, "系统错误[环境变量设置不正确]"),
    /**
     * 系统错误,网络连接失败
     */
    NET_CONNCET_ERROR			(-900602, "系统错误[网络连接失败]"),
    /**
     * 系统错误,数据库连接失败
     */
    DATABASE_CONNECT_ERROR		(-900603, "系统错误[数据库连接失败]"),
    /**
     * 系统错误,数据库操作失败
     */
    DATABASE_CRUD_ERROR			(-900604, "系统错误[数据库操作失败]"),
    /**
     * 系统错误,内存分配失败
     */
    MEMORY_ALLOCATE_ERROR		(-900605, "系统错误[内存分配失败]"),
    /**
     * 系统错误,内存释放失败
     */
    MEMORY_RELEASE_ERROR		(-900606, "系统错误[内存释放失败]"),
    /**
     * 系统错误,加载库失败
     */
    LIB_LOAD_ERROR				(-900607, "系统错误[加载库失败]"),
    /**
     * 系统错误,卸载库失败
     */
    LIB_UNLOAD_ERROR			(-900608, "系统错误[卸载库失败]"),

    //---------------------------系统登录错误-------------------------------------
    /**
     * 登录成功
     */
    LOGIN_SUCCESS               (2000, "登录成功"),
    /**
     * 登录失败
     */
    LOGIN_FAIL                  (2001, "登录失败"),
    /**
     * 登录失败【用户名为空】
     */
    USER_NAME_IS_EMPTY          (2002, "登录失败[用户名为空]"),
    /**
     * 登录失败【用户密码为空】
     */
    USER_PASSWORD_IS_EMPTY      (2003, "登录失败[用户密码为空]"),
    /**
     * 登录失败【验证为空】
     */
    USER_AUTHCODE_IS_EMPTY      (2004, "登录失败[验证码为空]"),
    /**
     * 登录失败【用户不存在】
     */
    USER_IS_NOT_EXIST           (2005,"登录失败[用户不存在或用户错误]"),
    /**
     * 登录失败【用户已被禁用】
     */
    USER_IS_FORBIDDEN           (2006, "登录失败[用户已被禁用]"),
    /**
     * 登录失败【用户名或密码错误】
     */
    USERNAME_OR_PASSWORD_ERROR  (2007, "登录失败[用户名或密码错误]"),
    /**
     * 登录失败【验证码错误】
     */
    USER_AUTHCODE_IS_ERROR      (2008, "登录失败[验证码错误]"),
    /**
     * 用户已存在，注册失败
     */
    USER_IS_EXIST               (3001, "用户已存在，注册失败"),
    /**
     * 旧密码错误
     */
    OLD_PASSWORD_ERROR          (4001, "旧密码错误"),
    ;

    private int code;
    private String value;

    /**
     * 枚举构造函数
     * @param code 返回码
     * @param value 返回码描述
     */
    ResultEnum(int code, String value) {
        this.code = code;
        this.value = value;
    }

    /**
     * 返回错误枚举的代码
     *
     * @return 返回错误代码
     */
    public int getCode() {
        return code;
    }

    /**
     * 返回错误枚举的描述
     *
     * @return 返回错误描述
     */
    public String getValue() {
        return value;
    }
}
